# 01.Analysis Seoul CCTV
## 1.데이터 읽기

In [ ]:
### 데이터 분석을 위한 패키지 : Pandas
import pandas as pd

미설치 시 설치 방법
 !conda install -y pandas

In [ ]:
### CSV 파일 읽기
CCTV_Seoul = pd.read_csv("../../data/01.Seoul_CCTV/01. Seoul_CCTV.csv", encoding="UTF-8")

In [ ]:
CCTV_Seoul.head()
### 2행 만 읽기 CCTV_Seoul.head(2)

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [ ]:
### 끝에 줄만 읽기
CCTV_Seoul.tail()

    기관명    소계  2013년도 이전  2014년  2015년  2016년
20  용산구  2096       1368    218    112    398
21  은평구  2108       1138    224    278    468
22  종로구  1619        464    314    211    630
23   중구  1023        413    190     72    348
24  중랑구   916        509    121    177    109

In [ ]:
### 컬럼 명의 변경
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [ ]:
### 특정 컬럼 출력
CCTV_Seoul.columns[0]

'기관명'

In [ ]:
### 컬럼명 변경하기
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : "구별"},inplace=True)

In [ ]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [ ]:
### 엑셀 파일 읽기
pop_Seoul = pd.read_excel("../../data/01.Seoul_CCTV/01. Seoul_Population.xls",header=2,usecols="B,D,G,J,N")
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [ ]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]:"구별"},inplace=True)
pop_Seoul.rename(columns={pop_Seoul.columns[1]:"인구수"},inplace=True)
pop_Seoul.rename(columns={pop_Seoul.columns[2]:"한국인"},inplace=True)
pop_Seoul.rename(columns={pop_Seoul.columns[3]:"외국인"},inplace=True)
pop_Seoul.rename(columns={pop_Seoul.columns[4]:"고령자"},inplace=True)

In [ ]:
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

---

# 2.Pandas의 기초
- 파이썬에서 R만큼의 강력한 데이터 핸들링을제공하는 모듈
- 단일 프로세스에서는 최대 효율
- 코딩이 가능한 엑셀

In [ ]:
import pandas as pd
import numpy as np

- pandas는 통상적으로 pd
- numpy는 통상적으로 np

# Series
- index 와 Value 로 이뤄짐
- 한 가지 데이터 형만 가질 수 있음

In [ ]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
pd.Series([1,2,3,4] , dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [ ]:
### object : String과 같음
pd.Series([1,2,3,4] , dtype=str)

0    1
1    2
2    3
3    4
dtype: object

In [ ]:
### numpy로 선언
pd.Series(np.array([1,2,3,4]))

0    1
1    2
2    3
3    4
dtype: int32

In [ ]:
### 딕셔너리 선언
pd.Series({"Key":"Value"})

Key    Value
dtype: object

In [ ]:
### 숫자와 문자열을 동시에 선언가능 - 결과값 : object
data=pd.Series([1,2,3,4,"5"])
data

0    1
1    2
2    3
3    4
4    5
dtype: object

In [ ]:
### 짝수만 찾기
data=pd.Series([1,2,3,4])
data%2

0    1
1    0
2    1
3    0
dtype: int64

### 날짜데이터
- 날짜 : 문자열로 선언
- periods : 언제까지 할건지

In [ ]:
pd.date_range("20250524",periods=6)

DatetimeIndex(['2025-05-24', '2025-05-25', '2025-05-26', '2025-05-27',
               '2025-05-28', '2025-05-29'],
              dtype='datetime64[ns]', freq='D')

---

## DataFrame
- pd.DataFrame()
- index, value, column으로 이뤄짐

In [ ]:
### 표준 정규분포에서 샘플링한 난수 생성
data=np.random.randn(6,4)
dates=pd.date_range("20250524",periods=6)

df=pd.DataFrame(data,index=dates,columns=["A","B","C","D"])

### 데이터 프레임 정보 탐색

#### df.head()
-  위쪽 데이터 출력

In [ ]:
df.head()

                   A         B         C         D
2025-05-24  0.824590  0.363020 -0.809635  1.190599
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933

#### df.tail()
-  아래쪽 데이터 출력

In [ ]:
df.tail()

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944

### df.index
- 인덱스 출력

In [ ]:
df.index

DatetimeIndex(['2025-05-24', '2025-05-25', '2025-05-26', '2025-05-27',
               '2025-05-28', '2025-05-29'],
              dtype='datetime64[ns]', freq='D')

### df.columns
- 컬럼 출력

In [ ]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### df.values
- 값들 출력

In [ ]:
df.values

array([[ 0.82459007,  0.3630201 , -0.80963501,  1.19059885],
       [ 0.7967222 ,  1.72108   ,  0.82702437, -0.04618567],
       [-0.9443549 , -0.33074099, -0.80501164,  1.0372177 ],
       [-0.38706003,  1.12419977,  1.36134273, -0.21536342],
       [ 1.88659817,  0.83987653, -1.69697765, -0.1519334 ],
       [-1.42196754,  0.51779346, -0.44117548, -2.16794414]])

### df.info()
- 데이터 프레임의 기본 정보 확인

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2025-05-24 to 2025-05-29
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

### df.describe()
- 데이터 프레임의 기술 통계 정보를 확인 가능

In [ ]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.125755  0.705871 -0.260739 -0.058935
std    1.252413  0.700156  1.140810  1.203668
min   -1.421968 -0.330741 -1.696978 -2.167944
25%   -0.805031  0.401713 -0.808479 -0.199506
50%    0.204831  0.678835 -0.623094 -0.099060
75%    0.817623  1.053119  0.509974  0.766367
max    1.886598  1.721080  1.361343  1.190599

### df.sort_values()
- 데이터 정렬
- 특정 컬럼을 기준으로 데이터를 정렬함

In [ ]:
df

                   A         B         C         D
2025-05-24  0.824590  0.363020 -0.809635  1.190599
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944

In [ ]:
df.sort_values(by="B")

                   A         B         C         D
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218
2025-05-24  0.824590  0.363020 -0.809635  1.190599
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-25  0.796722  1.721080  0.827024 -0.046186

##### ascending=False
- 내림차순  하는 옵션

In [ ]:
df.sort_values(by="B",ascending=False)

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944
2025-05-24  0.824590  0.363020 -0.809635  1.190599
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218

##### inplace=True
  정렬 저장하기

In [ ]:
df.sort_values(by="B",ascending=False,inplace=True)

### 데이터 선택

#### df[<컬럼명>]
- 특정 컬럼 선택
- 시리즈 타입을 리턴함

In [ ]:
df["A"]

2025-05-25    0.796722
2025-05-27   -0.387060
2025-05-28    1.886598
2025-05-29   -1.421968
2025-05-24    0.824590
2025-05-26   -0.944355
Name: A, dtype: float64

- 컬럼명이 알파벳인 경우 대괄화 없이 가능

In [ ]:
df.A

2025-05-25    0.796722
2025-05-27   -0.387060
2025-05-28    1.886598
2025-05-29   -1.421968
2025-05-24    0.824590
2025-05-26   -0.944355
Name: A, dtype: float64

#### df[<컬럼1>,<컬럼2>]
  - 복수의 컬럼 선택

In [ ]:
df[["A","B"]]

                   A         B
2025-05-25  0.796722  1.721080
2025-05-27 -0.387060  1.124200
2025-05-28  1.886598  0.839877
2025-05-29 -1.421968  0.517793
2025-05-24  0.824590  0.363020
2025-05-26 -0.944355 -0.330741

#### df[n:m]
- n부터 m-1까지 슬라이싱

In [ ]:
df[0:3]

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933

#### df[<컬럼명1>:<컬럼명2>]
- 컬럼명 1 부터 컬럼명 2까지 (포함)

In [ ]:
df["2025-05-25":"2025-05-28"]

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218

#### loc
- 인덱스 이름으로 특정 행과 열을 선택

In [ ]:
df.loc[:,["A","B"]]

                   A         B
2025-05-25  0.796722  1.721080
2025-05-27 -0.387060  1.124200
2025-05-28  1.886598  0.839877
2025-05-29 -1.421968  0.517793
2025-05-24  0.824590  0.363020
2025-05-26 -0.944355 -0.330741

In [ ]:
df.loc["2025-05-25":"2025-05-28",["A","B"]]

                   A         B
2025-05-25  0.796722  1.721080
2025-05-27 -0.387060  1.124200
2025-05-28  1.886598  0.839877
2025-05-26 -0.944355 -0.330741

In [ ]:
df.loc["2025-05-25":"2025-05-28","A":"D"]

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218

### iloc
- 컴퓨터가 인식하는 인덱스 값으로 선택
- 0,1,2,3,4 등으로  선택함

In [ ]:
df.iloc[3]

A   -1.421968
B    0.517793
C   -0.441175
D   -2.167944
Name: 2025-05-29 00:00:00, dtype: float64

In [ ]:
df.iloc[3,2]

-0.44117548424710656

In [ ]:
df.iloc[3:5,0:2]

                   A         B
2025-05-29 -1.421968  0.517793
2025-05-24  0.824590  0.363020

##### 특정 컬럼만 선택하기

In [ ]:
df.iloc[[1,2,4],[0.,2]]

                   A         C
2025-05-27 -0.387060  1.361343
2025-05-28  1.886598 -1.696978
2025-05-24  0.824590 -0.809635

In [ ]:
df.iloc[:,1:3]

                   B         C
2025-05-25  1.721080  0.827024
2025-05-27  1.124200  1.361343
2025-05-28  0.839877 -1.696978
2025-05-29  0.517793 -0.441175
2025-05-24  0.363020 -0.809635
2025-05-26 -0.330741 -0.805012

#### 조건 부여 (Condition)

-  0보다 큰 숫자만 선택
-  NaN : Not a Number : 숫자가 없음

In [ ]:
df["A"]>0

2025-05-25     True
2025-05-27    False
2025-05-28     True
2025-05-29    False
2025-05-24     True
2025-05-26    False
Name: A, dtype: bool

In [ ]:
df[df["A"]>0]

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-24  0.824590  0.363020 -0.809635  1.190599

In [ ]:
df[df>0]

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024       NaN
2025-05-27       NaN  1.124200  1.361343       NaN
2025-05-28  1.886598  0.839877       NaN       NaN
2025-05-29       NaN  0.517793       NaN       NaN
2025-05-24  0.824590  0.363020       NaN  1.190599
2025-05-26       NaN       NaN       NaN  1.037218

### 컬럼 추가
#### df["컬럼명"]=[<컬럼내용>]
- 기존 컬럼이 없을 시 추가
- 기존 컬럼이 있을 시 업데이트

In [ ]:
df["E"]=["1","2","3","4","4","5"]
df

                   A         B         C         D  E
2025-05-25  0.796722  1.721080  0.827024 -0.046186  1
2025-05-27 -0.387060  1.124200  1.361343 -0.215363  2
2025-05-28  1.886598  0.839877 -1.696978 -0.151933  3
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944  4
2025-05-24  0.824590  0.363020 -0.809635  1.190599  4
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218  5

#### isin()
- 특정 요소가 있는지 확인
- bool로 리턴함

In [ ]:
df["E"].isin(["1","4"])

2025-05-25     True
2025-05-27    False
2025-05-28    False
2025-05-29     True
2025-05-24     True
2025-05-26    False
Name: E, dtype: bool

- 실제로 존재하는 값만 출력하기

In [ ]:
df[df["E"].isin(["1","4"])]

                   A         B         C         D  E
2025-05-25  0.796722  1.721080  0.827024 -0.046186  1
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944  4
2025-05-24  0.824590  0.363020 -0.809635  1.190599  4

### 특정 컬럼 제거
- del
- drop

In [ ]:
del df["E"]
df

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944
2025-05-24  0.824590  0.363020 -0.809635  1.190599
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218

#### drop
- axis 옵션을 통해서 어떤걸 삭제 할지 바꿈
- axis = 0 : 가로
- axis = 1 : 세로

In [ ]:
df.drop(["D"] , axis=1)

                   A         B         C
2025-05-25  0.796722  1.721080  0.827024
2025-05-27 -0.387060  1.124200  1.361343
2025-05-28  1.886598  0.839877 -1.696978
2025-05-29 -1.421968  0.517793 -0.441175
2025-05-24  0.824590  0.363020 -0.809635
2025-05-26 -0.944355 -0.330741 -0.805012

In [ ]:
df.drop(["2025-05-24"] , axis=0)

                   A         B         C         D
2025-05-25  0.796722  1.721080  0.827024 -0.046186
2025-05-27 -0.387060  1.124200  1.361343 -0.215363
2025-05-28  1.886598  0.839877 -1.696978 -0.151933
2025-05-29 -1.421968  0.517793 -0.441175 -2.167944
2025-05-26 -0.944355 -0.330741 -0.805012  1.037218

a

In [ ]:
df["A"].apply("sum")

0.7545279573319197

In [ ]:
df[["A","D"]].apply("sum")

A    0.754528
D   -0.353610
dtype: float64

In [ ]:
df["A"].apply(np.cumsum)

2025-05-25        [0.79672219520659]
2025-05-27    [-0.38706003227318875]
2025-05-28      [1.8865981696497378]
2025-05-29     [-1.4219675420710762]
2025-05-24      [0.8245900713892681]
2025-05-26     [-0.9443549045694113]
Name: A, dtype: object

#### 양수/음수 확인 함수 만들기

In [ ]:
def plusMinus(num):
    return "plus" if num > 0 else "minus"

In [ ]:
df["A"].apply(plusMinus)

2025-05-25     plus
2025-05-27    minus
2025-05-28     plus
2025-05-29    minus
2025-05-24     plus
2025-05-26    minus
Name: A, dtype: object

In [ ]:
df["A"].apply(lambda num : "plus" if num>0 else "minus")

2025-05-25     plus
2025-05-27    minus
2025-05-28     plus
2025-05-29    minus
2025-05-24     plus
2025-05-26    minus
Name: A, dtype: object

# 3. CCTV 데이터 둘러보기
3-1) 데이터 특징 확인
- tail : 데이터 끝 쪽 볼 수 있음
  - 마지막 줄 인덱스 > 24
  - 총 데이터 25개

In [ ]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [ ]:
CCTV_Seoul.tail()

     구별    소계  2013년도 이전  2014년  2015년  2016년
20  용산구  2096       1368    218    112    398
21  은평구  2108       1138    224    278    468
22  종로구  1619        464    314    211    630
23   중구  1023        413    190     72    348
24  중랑구   916        509    121    177    109

## 3-2) sort
- 특정 값을 자세하기 볼 수 있음
- 소계가 적은 순으로 보기

In [ ]:
CCTV_Seoul.sort_values(by="소계",ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  825        238    159     42    386
2   강북구  831        369    120    138    204
5   광진구  878        573     78     53    174
3   강서구  911        388    258    184     81
24  중랑구  916        509    121    177    109

- 내림차순으로 출력해서 많은 순으로 보기

In [ ]:
CCTV_Seoul.sort_values(by="소계",ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  3238       1292    430    584    932
18  양천구  2482       1843    142     30    467
14  서초구  2297       1406    157    336    398
4   관악구  2109        846    260    390    613
21  은평구  2108       1138    224    278    468

## 3-3) 데이터의 추가
- 필요한 데이터는 새롭게 추가함
- 해당 컬럼이 없으면 추가 / 있으면 업데이트
    - 최근 증가율 : 최근 몇 년간 시리즈를 합함

In [ ]:
CCTV_Seoul["최근증가율"]=(
    (CCTV_Seoul["2016년"]+CCTV_Seoul["2015년"]+CCTV_Seoul["2014년"])/CCTV_Seoul["2013년도 이전"]*100
)
CCTV_Seoul.sort_values(by="최근증가율",ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1619        464    314    211    630  248.922414
9   도봉구   825        238    159     42    386  246.638655
12  마포구   980        314    118    169    379  212.101911
8   노원구  1566        542     57    451    516  188.929889
1   강동구  1010        379     99    155    377  166.490765

# 4. 인구현황 데이터 보기
- 필요 없는 데이터 삭제
- 합계 데이터는 필요 없으므로 삭제

In [ ]:
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

In [ ]:
pop_Seoul.tail()

     구별     인구수     한국인    외국인    고령자
21  관악구  520929  503297  17632  70046
22  서초구  445401  441102   4299  53205
23  강남구  561052  556164   4888  65060
24  송파구  671173  664496   6677  76582
25  강동구  440359  436223   4136  56161

In [ ]:
pop_Seoul.drop([0],axis=0 , inplace=True)
pop_Seoul.head()

    구별     인구수     한국인    외국인    고령자
1  종로구  164257  154770   9487  26182
2   중구  134593  125709   8884  21384
3  용산구  244444  229161  15283  36882
4  성동구  312711  304808   7903  41273
5  광진구  372298  357703  14595  43953

- unique() : dedup함

In [ ]:
pop_Seoul["구별"].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구'], dtype=object)

In [ ]:
len(pop_Seoul["자치구"].unique())

25

- 외국인 비율 / 고령자 비율

In [ ]:
pop_Seoul["외국인비율"]=pop_Seoul["외국인"]/pop_Seoul["인구수"] * 100
pop_Seoul["고령자비율"]=pop_Seoul["고령자"]/pop_Seoul["인구수"] * 100
pop_Seoul.head()

    구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
1  종로구  164257  154770   9487  26182  5.775705  15.939656
2   중구  134593  125709   8884  21384  6.600640  15.887899
3  용산구  244444  229161  15283  36882  6.252148  15.088118
4  성동구  312711  304808   7903  41273  2.527254  13.198448
5  광진구  372298  357703  14595  43953  3.920247  11.805865

In [ ]:
pop_Seoul.sort_values(by="인구수",ascending=False).head()

     구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
24  송파구  671173  664496   6677  76582  0.994825  11.410173
16  강서구  608255  601691   6564  76032  1.079153  12.500021
23  강남구  561052  556164   4888  65060  0.871220  11.596073
11  노원구  558075  554403   3672  74243  0.657976  13.303409
21  관악구  520929  503297  17632  70046  3.384722  13.446362

In [ ]:
pop_Seoul.sort_values(by="외국인비율",ascending=False).head()

      구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
19  영등포구  402024  368550  33474  53981  8.326369  13.427308
18   금천구  253491  235154  18337  34170  7.233787  13.479769
17   구로구  441559  410742  30817  58794  6.979135  13.315095
2     중구  134593  125709   8884  21384  6.600640  15.887899
3    용산구  244444  229161  15283  36882  6.252148  15.088118

In [ ]:
pop_Seoul.sort_values(by="고령자비율",ascending=False).head()

      구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
9    강북구  328002  324479   3523  56530  1.074079  17.234651
1    종로구  164257  154770   9487  26182  5.775705  15.939656
2     중구  134593  125709   8884  21384  6.600640  15.887899
10   도봉구  346234  344166   2068  53488  0.597284  15.448512
6   동대문구  366011  350647  15364  55718  4.197688  15.223040

In [ ]:
### 연동 테스트 하기